src/main/wsdl/CreditService.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions targetNamespace="http://itq.edu/soa/credit" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:tns="http://itq.edu/soa/credit" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <wsdl:types>
    <xs:schema elementFormDefault="qualified" targetNamespace="http://itq.edu/soa/credit">
			<xs:include schemaLocation="BuroCredito.xsd"/>
		</xs:schema>
  </wsdl:types>
  <wsdl:message name="CreditRequest">
    <wsdl:part name="parameter" element="tns:creditRequest">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="CreditResponse">
    <wsdl:part name="parameter" element="tns:creditResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="CreditPortType">
    <wsdl:operation name="CreditOperation">
      <wsdl:input message="tns:CreditRequest">
    </wsdl:input>
      <wsdl:output message="tns:CreditResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="CreditBinding" type="tns:CreditPortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="CreditOperation">
      <soap:operation soapAction="http://itq.edu/factura/generarCredito"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="CreditService">
    <wsdl:port name="CreditPort" binding="tns:CreditBinding">
      <soap:address location="http://localhost:8088/generarCredito"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
